----------------------------------------------------------------------------------------------------------------------------------
--[[

    中文文本
    
]]--
----------------------------------------------------------------------------------------------------------------------------------


local crrent_language = "ch"
if TUNING.FUNNY_CAT_GET_LANGUAGE() ~= crrent_language then
    return
end

local strings = {   
    --------------------------------------------------------------------
    --- 正在debug 测试的
        ["fwd_in_pdt_skin_test_item"] = {
            ["name"] = "皮肤测试物品",
            ["inspect_str"] = "inspect单纯的测试皮肤",
            ["recipe_desc"] = "测试描述666",
        },
    --------------------------------------------------------------------
    --------------------------------------------------------------------
    --------------------------------------------------------------------
}

TUNING.FUNNY_CAT_GET_STRINGS = function(prefab_name)
    return strings[prefab_name] or {}
end

TUNING.FUNNY_CAT_GET_ALL_STRINGS = function()
    return strings
end