--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--[[

    把官方的皮肤赋予给自己的物品

    PREFAB_SKINS["npc_item_magic_tophat"] = PREFAB_SKINS["tophat"]
    PREFAB_SKINS_IDS["npc_item_magic_tophat"] = PREFAB_SKINS_IDS["tophat"]

]]--
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

PREFAB_SKINS["funny_cat_item_cleaning_broom"] = PREFAB_SKINS["reskin_tool"]
PREFAB_SKINS_IDS["funny_cat_item_cleaning_broom"] = PREFAB_SKINS_IDS["reskin_tool"]